def area(a,h):
    """
    Возвращает площадь треугольника.
    Параметры:
        a(float)-сторона треугольника.
        h(float)-высота треугольника проведенная к стороне с размером a
    Пример:
        area(2,3)=2 * 3 / 2 = 3
    """
    return a * h / 2

def perimeter(a, b, c):
    """
    Возвращает периметр треугольника.
    Параметры:
        a(float)-1 сторона треугольника.
        b(float)-2 сторона треугольника.
        c(float)-3 сторона треугольника.
    Пример:
        perimeter(1,2,3)=1 + 2 + 3 = 6
    """
    return a + b + c

